Revit 2026 API

# DoubleArrayIterator Constructor

---

For Internal Use Only.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public DoubleArrayIterator()
```
```vb
Public Sub New
```
```cpp
public:
DoubleArrayIterator()
```
```fsharp
new : unit -> DoubleArrayIterator
```

This constructor is exposed to enable support for COM interop only. This object should never be created by the developer.

#### Reference

DoubleArrayIterator Class

Autodesk.Revit.DB Namespace